_Rarzrabotki/Rarus/USO2/Reports/СМ_ВедомостьПотребностиВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СМ_ВедомостьПотребностиВРесурсах</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_СводнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлаваССРС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазбивкаПоГодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/СМ_ВедомостьПотребностиВРесурсах/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура СформироватьНаСервере(ФактическиеРесурсы,ГруппироватьСтатусы = Ложь)
	
	Если Смета.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если (КлючОбъектСмета = "ПоОбъектам") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Пометка", Истина);
		МассивСмет = ТаблицаСмет.Выгрузить(Отбор, "Смета").ВыгрузитьКолонку("Смета");
		Стройка = ОбъектСтроительства;
	Иначе
		МассивСмет = Новый Массив;
		МассивСмет.Добавить(Смета);
		Стройка = Неопределено;
	КонецЕсли;
	ОтчетОбъект.ПолучитьЗаполненныйОтчет(МассивСмет, Стройка, Результат, ФактическиеРесурсы, Ранжировать, ПечатьБланка, НаОстаток,ГруппироватьСтатусы, ?(ИспользованиеСтатусРесурса, СтатусРесурса, Неопределено));
	
	ПечУровень = Результат.КоличествоУровнейГруппировокСтрок(); 
	Результат.ПоказатьУровеньГруппировокСтрок(ПечУровень-2);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере(ФактическиеРесурсы,ГруппироватьСтатусы);
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаСтраницыОтчета.ПодчиненныеЭлементы.ГруппаРезультат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(КлючОбъектСмета) Тогда
		КлючОбъектСмета = "ПоСметам";
		Если Не ГлобальнаяСтрокаДереваСмет = Неопределено И Не ГлобальнаяСтрокаДереваСмет.ПометкаУдаления Тогда
			Смета = ГлобальнаяСтрокаДереваСмет.Ссылка;
			ОбъектСтроительства = ГлобальнаяСтрокаДереваСмет.Стройка;
		КонецЕсли;
	КонецЕсли;
	ВидимостьЭлементов();
	Элементы.ПолеВидаСравнения.СписокВыбора.Добавить(ВидСравнения.Равно);
	Элементы.ПолеВидаСравнения.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	ПолеВидаСравнения = ВидСравнения.Равно;
	// РанжироватьПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СметаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС 	= Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	СтруктураПараметров 			= Новый Структура;
	СтруктураПараметров.Вставить("ВключатьОС",Истина);
	СтруктураПараметров.Вставить("ВключатьСС",Истина);
	СтруктураПараметров.Вставить("БезПомеченных",Истина);
	СтруктураПараметров.Вставить("ОтборСтройка",Истина);
	
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Смета = ТекЛС;
КонецПроцедуры

&НаКлиенте
Процедура КлючТекущегоВариантаПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Элементы.Объект.Видимость		= КлючОбъектСмета = "ПоОбъектам";
	Элементы.ПолеВидаСравнения.Видимость		= КлючОбъектСмета = "ПоОбъектам";
	Элементы.ТаблицаСмет.Видимость	= Элементы.Объект.Видимость;
	Элементы.Смета.Видимость		= КлючОбъектСмета <> "ПоОбъектам";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОбъектПриИзмененииНаСервере();
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаСтраницыОтчета.ПодчиненныеЭлементы.ГруппаСметы;
КонецПроцедуры

&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ЛокальнаяСмета.Ссылка КАК Смета,
	               |	ИСТИНА КАК Пометка
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |ГДЕ
	               |	СМ_ЛокальнаяСмета.Проведен = ИСТИНА
	               |	И (СМ_ЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |			ИЛИ СМ_ЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |			ИЛИ СМ_ЛокальнаяСмета.ИДРодителя = НЕОПРЕДЕЛЕНО)
	               |	И СМ_ЛокальнаяСмета.Стройка В ИЕРАРХИИ(&Стройка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ОбъектнаяСмета.Ссылка,
	               |	ИСТИНА
	               |ИЗ
	               |	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета
	               |ГДЕ
	               |	СМ_ОбъектнаяСмета.Проведен = ИСТИНА
	               |	И (СМ_ОбъектнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |			ИЛИ СМ_ОбъектнаяСмета.ИДРодителя = НЕОПРЕДЕЛЕНО)
	               |	И СМ_ОбъектнаяСмета.Стройка В ИЕРАРХИИ(&Стройка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_СводнаяСмета.Ссылка,
	               |	ИСТИНА
	               |ИЗ
	               |	Документ.СМ_СводнаяСмета КАК СМ_СводнаяСмета
	               |ГДЕ
	               |	СМ_СводнаяСмета.Проведен = ИСТИНА
	               |	И СМ_СводнаяСмета.Стройка В ИЕРАРХИИ(&Стройка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Смета";
	Запрос.УстановитьПараметр("Стройка", ОбъектСтроительства);
	ТаблицаСмет.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыЗаполнения);
		ОбъектПриИзмененииНаСервере();
	КонецЕсли;
	
	// СформироватьПользовательскиеНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РанжироватьПриИзменении(Элемент)
	РанжироватьПриИзмененииНаСервере(ГруппироватьСтатусы);
КонецПроцедуры

&НаСервере
Процедура РанжироватьПриИзмененииНаСервере(ГруппироватьСтатусы)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СтруктураВариантов = Новый Структура;
	КлючТекущегоВарианта = ЭтотОбъект.КлючТекущегоВарианта;
	СхемаКомпоновкиДанных = ?(ГруппироватьСтатусы,ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхСтатусы"),ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	пНастройки = СтруктураВариантов[КлючТекущегоВарианта];
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(пНастройки);
	ЭтотОбъект.КлючТекущегоВарианта = КлючТекущегоВарианта;

	// КлючТекущегоВарианта = СтрЗаменить(ЭтотОбъект.КлючТекущегоВарианта,"Ранжирование","");
	// Если Ранжировать Тогда
	//	СтруктураВариантов = Новый Структура;
	//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//	СхемаКомпоновкиДанных = ?(ГруппироватьСтатусы,ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхСтатусы"),ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));

	//	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	//	Для Каждого пЭл ИЗ пВарианты Цикл
	//		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	//	КонецЦикла;
	//	КлючТекущегоВарианта = КлючТекущегоВарианта+"Ранжирование";
	//	пНастройки = СтруктураВариантов[КлючТекущегоВарианта];
	//	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(пНастройки);
	//	ЭтотОбъект.КлючТекущегоВарианта = КлючТекущегоВарианта;
	// Иначе
	//	СтруктураВариантов = Новый Структура;
	//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//	СхемаКомпоновкиДанных = ?(ГруппироватьСтатусы,ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхСтатусы"),ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
	//	
	//	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	//	Для Каждого пЭл ИЗ пВарианты Цикл
	//		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	//	КонецЦикла;
	//	пНастройки = СтруктураВариантов[КлючТекущегоВарианта];
	//	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(пНастройки);
	//	ЭтотОбъект.КлючТекущегоВарианта = КлючТекущегоВарианта;
	// КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// ИдентификаторРасшифровкиКомпоновкиДанных
	// Сообщить(ДанныеРасшифровки[Расшифровка]);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='" + ДанныеРасшифровки[Расшифровка] + "'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВидаСравненияПриИзменении(Элемент)
	Если ПолеВидаСравнения = ВидСравнения.ВСписке Тогда
		Стройка = ОбъектСтроительства;
		ОбъектСтроительства = Новый СписокЗначений;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.СМ_ОбъектыСтроительства"));
		
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);

		ОбъектСтроительства.ТипЗначения = ДопустимыеТипы;
		ОбъектСтроительства.Добавить(Стройка);
	Иначе
		СписокСтроек = ОбъектСтроительства;
		ОбъектСтроительства = ?(СписокСтроек.Количество()=0,ПредопределенноеЗначение("Справочник.СМ_ОбъектыСтроительства.ПустаяСсылка"),СписокСтроек[0].Значение);
	КонецЕсли;
	ОбъектПриИзмененииНаСервере();
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаСтраницыОтчета.ПодчиненныеЭлементы.ГруппаСметы;
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьСтатусыПриИзменении(Элемент)
	РанжироватьПриИзмененииНаСервере(ГруппироватьСтатусы);
КонецПроцедуры

#КонецОбласти
